### AWS UAT App plan Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  erraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-cbb92633.ttf"] will be destroyed
  # (because key ["assets/devicons-cbb92633.ttf"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "font/ttf" -> null
      - etag                   = "5ed4d6468a5a0f3cf9c82f854936feab" -> null
      - force_destroy          = true -> null
      - id                     = "assets/devicons-cbb92633.ttf" -> null
      - key                    = "assets/devicons-cbb92633.ttf" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/devicons-cbb92633.ttf" -> null
      - source_hash            = "5ed4d6468a5a0f3cf9c82f854936feab" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-d7c9f264.svg"] will be destroyed
  # (because key ["assets/devicons-d7c9f264.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "a21d3c630e856b5fb26fd3d6f1b894ff" -> null
      - force_destroy          = true -> null
      - id                     = "assets/devicons-d7c9f264.svg" -> null
      - key                    = "assets/devicons-d7c9f264.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/devicons-d7c9f264.svg" -> null
      - source_hash            = "a21d3c630e856b5fb26fd3d6f1b894ff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-2adefcbc.woff2"] will be destroyed
  # (because key ["assets/fontawesome-webfont-2adefcbc.woff2"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "font/woff2" -> null
      - etag                   = "af7ae505a9eed503f8b8e6982036873e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/fontawesome-webfont-2adefcbc.woff2" -> null
      - key                    = "assets/fontawesome-webfont-2adefcbc.woff2" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-2adefcbc.woff2" -> null
      - source_hash            = "af7ae505a9eed503f8b8e6982036873e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-7bfcab6d.eot"] will be destroyed
  # (because key ["assets/fontawesome-webfont-7bfcab6d.eot"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/vnd.ms-fontobject" -> null
      - etag                   = "674f50d287a8c48dc19ba404d20fe713" -> null
      - force_destroy          = true -> null
      - id                     = "assets/fontawesome-webfont-7bfcab6d.eot" -> null
      - key                    = "assets/fontawesome-webfont-7bfcab6d.eot" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-7bfcab6d.eot" -> null
      - source_hash            = "674f50d287a8c48dc19ba404d20fe713" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-aa58f33f.ttf"] will be destroyed
  # (because key ["assets/fontawesome-webfont-aa58f33f.ttf"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "font/ttf" -> null
      - etag                   = "b06871f281fee6b241d60582ae9369b9" -> null
      - force_destroy          = true -> null
      - id                     = "assets/fontawesome-webfont-aa58f33f.ttf" -> null
      - key                    = "assets/fontawesome-webfont-aa58f33f.ttf" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-aa58f33f.ttf" -> null
      - source_hash            = "b06871f281fee6b241d60582ae9369b9" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ad615792.svg"] will be destroyed
  # (because key ["assets/fontawesome-webfont-ad615792.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "912ec66d7572ff821749319396470bde" -> null
      - force_destroy          = true -> null
      - id                     = "assets/fontawesome-webfont-ad615792.svg" -> null
      - key                    = "assets/fontawesome-webfont-ad615792.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-ad615792.svg" -> null
      - source_hash            = "912ec66d7572ff821749319396470bde" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ba0c59de.woff"] will be destroyed
  # (because key ["assets/fontawesome-webfont-ba0c59de.woff"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "font/woff" -> null
      - etag                   = "fee66e712a8a08eef5805a46892932ad" -> null
      - force_destroy          = true -> null
      - id                     = "assets/fontawesome-webfont-ba0c59de.woff" -> null
      - key                    = "assets/fontawesome-webfont-ba0c59de.woff" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/fontawesome-webfont-ba0c59de.woff" -> null
      - source_hash            = "fee66e712a8a08eef5805a46892932ad" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-66b10136.jpg"] will be destroyed
  # (because key ["assets/github_profile_pic-66b10136.jpg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/jpeg" -> null
      - etag                   = "a85d8d094e6d9a7903c5829c0ed09432" -> null
      - force_destroy          = true -> null
      - id                     = "assets/github_profile_pic-66b10136.jpg" -> null
      - key                    = "assets/github_profile_pic-66b10136.jpg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/github_profile_pic-66b10136.jpg" -> null
      - source_hash            = "a85d8d094e6d9a7903c5829c0ed09432" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/home-9e3f4fe0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/home-9e3f4fe0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/home-9e3f4fe0.js"
      + source_hash            = "cd039402559a2162186b954dc8634a35"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"] will be destroyed
  # (because key ["assets/html2canvas.esm-0a33ed42.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "955bf9b222a46a0897ad2d52916463de" -> null
      - force_destroy          = true -> null
      - id                     = "assets/html2canvas.esm-0a33ed42.js" -> null
      - key                    = "assets/html2canvas.esm-0a33ed42.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/html2canvas.esm-0a33ed42.js" -> null
      - source_hash            = "955bf9b222a46a0897ad2d52916463de" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"] will be destroyed
  # (because key ["assets/index-9a0f5c31.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "056b4c93c0fc46fc6fee5d5c316171b9" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-9a0f5c31.css" -> null
      - key                    = "assets/index-9a0f5c31.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/index-9a0f5c31.css" -> null
      - source_hash            = "056b4c93c0fc46fc6fee5d5c316171b9" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-f44d04de.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-f44d04de.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index-f44d04de.css"
      + source_hash            = "a202d7ec6bb4ef58e833474ba09f6de7"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-f711b34b.js"] will be destroyed
  # (because key ["assets/index-f711b34b.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "160cfe3790fb9a1b97f9d92d629d225f" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-f711b34b.js" -> null
      - key                    = "assets/index-f711b34b.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/index-f711b34b.js" -> null
      - source_hash            = "160cfe3790fb9a1b97f9d92d629d225f" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-1ae83452.js"] will be destroyed
  # (because key ["assets/index.es-1ae83452.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "93628814e00e5563bc178b81e65b273b" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-1ae83452.js" -> null
      - key                    = "assets/index.es-1ae83452.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/index.es-1ae83452.js" -> null
      - source_hash            = "93628814e00e5563bc178b81e65b273b" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/powershell_devicon_forest_green-f06a1fda.svg"] will be destroyed
  # (because key ["assets/powershell_devicon_forest_green-f06a1fda.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "3af47f89e61fe763b909c1fabc4c4083" -> null
      - force_destroy          = true -> null
      - id                     = "assets/powershell_devicon_forest_green-f06a1fda.svg" -> null
      - key                    = "assets/powershell_devicon_forest_green-f06a1fda.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/powershell_devicon_forest_green-f06a1fda.svg" -> null
      - source_hash            = "3af47f89e61fe763b909c1fabc4c4083" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"] will be destroyed
  # (because key ["assets/purify.es-3ef59d4c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f17593fbd13b830e8b0da63f75b8f242" -> null
      - force_destroy          = true -> null
      - id                     = "assets/purify.es-3ef59d4c.js" -> null
      - key                    = "assets/purify.es-3ef59d4c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/purify.es-3ef59d4c.js" -> null
      - source_hash            = "f17593fbd13b830e8b0da63f75b8f242" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-24e0a860.js"] will be destroyed
  # (because key ["assets/recase-24e0a860.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "d8e1c611a6581a7685243e68e0fdbaa1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/recase-24e0a860.js" -> null
      - key                    = "assets/recase-24e0a860.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/recase-24e0a860.js" -> null
      - source_hash            = "d8e1c611a6581a7685243e68e0fdbaa1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/tableau_logo-ec7acb2d.svg"] will be destroyed
  # (because key ["assets/tableau_logo-ec7acb2d.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "b42fa60cb28ab38ad51179e8b40ff867" -> null
      - force_destroy          = true -> null
      - id                     = "assets/tableau_logo-ec7acb2d.svg" -> null
      - key                    = "assets/tableau_logo-ec7acb2d.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/tableau_logo-ec7acb2d.svg" -> null
      - source_hash            = "b42fa60cb28ab38ad51179e8b40ff867" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/terraform_devicon_forest_green-e7c4748a.svg"] will be destroyed
  # (because key ["assets/terraform_devicon_forest_green-e7c4748a.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "ab25c8b031fc668e363745b71dd395a2" -> null
      - force_destroy          = true -> null
      - id                     = "assets/terraform_devicon_forest_green-e7c4748a.svg" -> null
      - key                    = "assets/terraform_devicon_forest_green-e7c4748a.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/terraform_devicon_forest_green-e7c4748a.svg" -> null
      - source_hash            = "ab25c8b031fc668e363745b71dd395a2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ts_devicon_forest_green-0c5eea9d.svg"] will be destroyed
  # (because key ["assets/ts_devicon_forest_green-0c5eea9d.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "52658f776f4a1d3b285bc64c540aa7c5" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ts_devicon_forest_green-0c5eea9d.svg" -> null
      - key                    = "assets/ts_devicon_forest_green-0c5eea9d.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/ts_devicon_forest_green-0c5eea9d.svg" -> null
      - source_hash            = "52658f776f4a1d3b285bc64c540aa7c5" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/virtual_pwa-register-181e8f91.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/virtual_pwa-register-181e8f91.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/virtual_pwa-register-181e8f91.js"
      + source_hash            = "0a909e6776a1c9b995284ff97ce78025"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/vue_devicon_forest_green-2e14a2aa.svg"] will be destroyed
  # (because key ["assets/vue_devicon_forest_green-2e14a2aa.svg"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/svg+xml" -> null
      - etag                   = "b445c5110e3b0a783cfb923e99665079" -> null
      - force_destroy          = true -> null
      - id                     = "assets/vue_devicon_forest_green-2e14a2aa.svg" -> null
      - key                    = "assets/vue_devicon_forest_green-2e14a2aa.svg" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/assets/vue_devicon_forest_green-2e14a2aa.svg" -> null
      - source_hash            = "b445c5110e3b0a783cfb923e99665079" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/workbox-window.prod.es5-295a6886.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/workbox-window.prod.es5-295a6886.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/workbox-window.prod.es5-295a6886.js"
      + source_hash            = "b8c9397a5a7bdb9aee024d2c57d41845"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["favicon-dark.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "favicon-dark.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/favicon-dark.svg"
      + source_hash            = "7c40ba0cb1414d1c20f5e60e33e09a5f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.ico"] will be destroyed
  # (because key ["favicon.ico"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "public-read" -> null
      - bucket                 = "uat.marshmallowmeat.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "image/x-icon" -> null
      - etag                   = "15789dada2974fe2e62d763285aa97f0" -> null
      - force_destroy          = true -> null
      - id                     = "favicon.ico" -> null
      - key                    = "favicon.ico" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/dist/favicon.ico" -> null
      - source_hash            = "15789dada2974fe2e62d763285aa97f0" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.marshmallowmeat.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "marshmallowmeat.com"
          - "Project"         = "tf-web"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "favicon.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/favicon.svg"
      + source_hash            = "a795ab195c26601ea433babed25a7d0d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
      ~ acl                    = "public-read" -> "private"
        id                     = "index.html"
      ~ source                 = "./../../../../../app/dist/index.html" -> "./../../../../../app/build/index.html"
      ~ source_hash            = "13db61b71093644bed31c47d81552bac" -> "d7f9c9a4660de0cf1c7d3d9abc3b1a4d"
        tags                   = {
            "Bucket"          = "uat.marshmallowmeat.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "marshmallowmeat.com"
            "Project"         = "tf-web"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["manifest.webmanifest"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/manifest+json"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "manifest.webmanifest"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/manifest.webmanifest"
      + source_hash            = "37e8d18026b05432f623fc5efac2b4b1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pwa-192x192.png"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "pwa-192x192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/pwa-192x192.png"
      + source_hash            = "65f6c00ff3d88d8371df0480c1ba0272"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pwa-512x512.png"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "pwa-512x512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/pwa-512x512.png"
      + source_hash            = "20a2db7d5040eb315e6acf49c6983de9"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["readme.html"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "readme.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/readme.html"
      + source_hash            = "383b8323cb8fe5df65285d5e5e8ab4c3"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["robots.txt"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/plain"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/robots.txt"
      + source_hash            = "bc7d77685e5bf6193fe295a198511188"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["safari-pinned-tab.svg"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "image/svg+xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "safari-pinned-tab.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/safari-pinned-tab.svg"
      + source_hash            = "5eaf74d1c43d30e0af743b68a3f48504"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/xml"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "sitemap.xml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/sitemap.xml"
      + source_hash            = "39267d8c7c9cff8a50614b95286fe851"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "ssr-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/ssr-manifest.json"
      + source_hash            = "0a22fbad51112690d1c239e99027187b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sw.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "sw.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/sw.js"
      + source_hash            = "f40fbf09e51e0c6605ff625eaa0e1d42"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["workbox-01d9f47c.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.marshmallowmeat.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "workbox-01d9f47c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/workbox-01d9f47c.js"
      + source_hash            = "e7a5b2200c99a872b2834bd10d7832bc"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.marshmallowmeat.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 24 to add, 1 to change, 38 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
      - "a92e5bf9ff9dec037b5e5a818228e383",
      - "6aea85fb90c9a61defc42ea2f1bdd960",
      - "7e1dfd2dc8a5ee4b4955c4dab9170982",
      - "d254e9f4850a323e5ea30df3ac31964d",
      - "623d1343a7416bbbdbce909629e9939d",
      - "17c5dfdc342c2416f507ad7fcb8b9682",
      - "e24945a32789e1abf50be49be251389e",
      - "8d89581807d6c1c618e266b88c96e702",
      - "af5ebf02485dec5a476c3d41e227aa5c",
      - "fff573f20a9b2c51b01a41b063cbf6bd",
      - "538edd160449fc19008186b8965f28a7",
      - "66964670c414b9f1a947e184fd286b37",
      - "85561bf1ef41088b8c3f0f50a6a1fa81",
      - "e60911495dba8bb96def57539a94e9cf",
      - "302f026f7e053d0ccf4b0ed827f15900",
      - "89db6545390762231d3913a3cd717cf3",
      - "a8639dec5833a8375d22fe425b01f4eb",
      - "36c5ab9318386dc0499a0d89691e6331",
      - "5ed4d6468a5a0f3cf9c82f854936feab",
      - "a21d3c630e856b5fb26fd3d6f1b894ff",
      - "af7ae505a9eed503f8b8e6982036873e",
      - "674f50d287a8c48dc19ba404d20fe713",
      - "b06871f281fee6b241d60582ae9369b9",
      - "912ec66d7572ff821749319396470bde",
      - "fee66e712a8a08eef5805a46892932ad",
      - "a85d8d094e6d9a7903c5829c0ed09432",
      - "955bf9b222a46a0897ad2d52916463de",
      - "056b4c93c0fc46fc6fee5d5c316171b9",
      - "160cfe3790fb9a1b97f9d92d629d225f",
      - "93628814e00e5563bc178b81e65b273b",
      - "3af47f89e61fe763b909c1fabc4c4083",
      - "f17593fbd13b830e8b0da63f75b8f242",
      - "d8e1c611a6581a7685243e68e0fdbaa1",
      - "b42fa60cb28ab38ad51179e8b40ff867",
      - "ab25c8b031fc668e363745b71dd395a2",
      - "52658f776f4a1d3b285bc64c540aa7c5",
      - "b445c5110e3b0a783cfb923e99665079",
      - "15789dada2974fe2e62d763285aa97f0",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "13db61b71093644bed31c47d81552bac",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ s3_bucket_object_ids         = [
      - "assets/About-af54e33e.js",
      - "assets/ArticleLayouts-45b80bcd.js",
      - "assets/Articles-abc200d4.js",
      - "assets/Articles-cdca7afd.css",
      - "assets/Landing-ad247451.css",
      - "assets/Landing-db7eac9c.js",
      - "assets/PDF-19838165.css",
      - "assets/PDF-a433cf2a.js",
      - "assets/Start-b82ce7ab.js",
      - "assets/StartButtonFloat-7308c767.css",
      - "assets/StartButtonFloat-d1e323fd.js",
      - "assets/Terminal-12d70089.js",
      - "assets/Terminal-2e2ec67e.css",
      - "assets/azure_devicon_forest_green-ee780a3a.svg",
      - "assets/bash_devicon_forest_green-ab536553.svg",
      - "assets/d3_devicon_forest_green-b8696bec.svg",
      - "assets/devicons-4cbd2440.woff",
      - "assets/devicons-880373aa.eot",
      - "assets/devicons-cbb92633.ttf",
      - "assets/devicons-d7c9f264.svg",
      - "assets/fontawesome-webfont-2adefcbc.woff2",
      - "assets/fontawesome-webfont-7bfcab6d.eot",
      - "assets/fontawesome-webfont-aa58f33f.ttf",
      - "assets/fontawesome-webfont-ad615792.svg",
      - "assets/fontawesome-webfont-ba0c59de.woff",
      - "assets/github_profile_pic-66b10136.jpg",
      - "assets/html2canvas.esm-0a33ed42.js",
      - "assets/index-9a0f5c31.css",
      - "assets/index-f711b34b.js",
      - "assets/index.es-1ae83452.js",
      - "assets/powershell_devicon_forest_green-f06a1fda.svg",
      - "assets/purify.es-3ef59d4c.js",
      - "assets/recase-24e0a860.js",
      - "assets/tableau_logo-ec7acb2d.svg",
      - "assets/terraform_devicon_forest_green-e7c4748a.svg",
      - "assets/ts_devicon_forest_green-0c5eea9d.svg",
      - "assets/vue_devicon_forest_green-2e14a2aa.svg",
      - "favicon.ico",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "index.html",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ s3_bucket_object_keys_ids    = [
      ~ {
          ~ id  = "assets/About-af54e33e.js" -> (known after apply)
          ~ key = "assets/About-af54e33e.js" -> "_headers"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-45b80bcd.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-45b80bcd.js" -> "about.html"
        },
      ~ {
          ~ id  = "assets/Articles-abc200d4.js" -> (known after apply)
          ~ key = "assets/Articles-abc200d4.js" -> "assets/404-8c89564b.js"
        },
      ~ {
          ~ id  = "assets/Articles-cdca7afd.css" -> (known after apply)
          ~ key = "assets/Articles-cdca7afd.css" -> "assets/README-8752f6ce.js"
        },
      ~ {
          ~ id  = "assets/Landing-ad247451.css" -> (known after apply)
          ~ key = "assets/Landing-ad247451.css" -> "assets/_...all_-0334078a.js"
        },
      ~ {
          ~ id  = "assets/Landing-db7eac9c.js"
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*